<!doctype html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <title>Document</title>
</head>
<body>
<h3>
    <p>всего выделяют три основных принципа ООП:</p>
    <p>Наследование, Инкапсуляция, Полиморфизм</p>
</h3>
<h3>
    <p>Иными словами, инкапсюляция это не код, это просто метод построения кода, когда от пользователя скрывается то,
    чего пользователь видеть не должен. Так же можно скрыть фрагменты кода для их защиты, чтобы было неявное, для пользователя,
    исполнение функций. Простой пример инкапсюляции это использование private доступа к функции, так же открытость или закрытость класса</p>

    <p>Полиморфизм это так же метод построения кода, при котором одна функция может выполняться в разных частях программы.
    Простой пример, это использование protected или public доступа к фунции.</p>
</h3>
</body>
</html>
